---
kind: method
id: M:Autodesk.Revit.DB.Electrical.WireConduitTypeSetIterator.#ctor
source: html/6fd95723-f02b-48b7-d3d3-7b265c7a6a65.htm
---
# Autodesk.Revit.DB.Electrical.WireConduitTypeSetIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public WireConduitTypeSetIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.